app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def index
    @companies = Company.all

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def show
    @company = Company.find(params[:id])

INSERT INTO "companies" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 01 May 2012 02:02:52 UTC +00:00], ["name", "test"], ["updated_at", Tue, 01 May 2012 02:02:52 UTC +00:00]]
---
  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 3]]
---
  def destroy
    @company = Company.find(params[:id])
    @company.destroy